In [1]:
import pandas
pandas.__version__

'1.0.1'

In [2]:
import numpy as np
import pandas as pd

In [3]:
counts = pd.Series([2, 8, 9, 1])
counts

0    2
1    8
2    9
3    1
dtype: int64

In [4]:
counts.values

array([2, 8, 9, 1], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
flowers = pd.Series([2, 8, 9, 1], 
    index=['Rose', 'Lily','Lotus', 'Sunflower'])

flowers

Rose         2
Lily         8
Lotus        9
Sunflower    1
dtype: int64

In [7]:
flowers['Lily']

8

In [8]:
flowers[2]

9

In [9]:
flowers.name = 'counts'
flowers.index.name = 'nature'
flowers

nature
Rose         2
Lily         8
Lotus        9
Sunflower    1
Name: counts, dtype: int64

In [10]:
np.log(flowers)

nature
Rose         0.693147
Lily         2.079442
Lotus        2.197225
Sunflower    0.000000
Name: counts, dtype: float64

In [11]:
flowers[flowers>5]

nature
Lily     8
Lotus    9
Name: counts, dtype: int64

In [12]:
flowers_dict={'Rose':2 ,'Lily':8 , 'Lotus':9 , 'Sunflower':1}
print(flowers_dict)
pd.Series(flowers_dict)

{'Rose': 2, 'Lily': 8, 'Lotus': 9, 'Sunflower': 1}

Rose         2
Lily         8
Lotus        9
Sunflower    1
dtype: int64

In [13]:
data = {"Cities": ["MANGALORE", "MANGALORE", "BANGALORE", "BANGALORE", "KARWAR","KARWAR","MYSORE"],
        "Year": [2019, 2020, 2019, 2020, 2019 , 2020 , 2020],
        "Result": [8.6,  9.3, 8.9,9.8 , 9.6 , 8.9, 9.1]}
print(data)
data = pd.DataFrame(data)
data

{'Cities': ['MANGALORE', 'MANGALORE', 'BANGALORE', 'BANGALORE', 'KARWAR', 'KARWAR', 'MYSORE'], 'Year': [2019, 2020, 2019, 2020, 2019, 2020, 2020], 'Result': [8.6, 9.3, 8.9, 9.8, 9.6, 8.9, 9.1]}

      Cities  Year  Result
0  MANGALORE  2019     8.6
1  MANGALORE  2020     9.3
2  BANGALORE  2019     8.9
3  BANGALORE  2020     9.8
4     KARWAR  2019     9.6
5     KARWAR  2020     8.9
6     MYSORE  2020     9.1

In [14]:
df = pd.DataFrame(data, columns=["Year",  "Result" , "Cities"])
df

   Year  Result     Cities
0  2019     8.6  MANGALORE
1  2020     9.3  MANGALORE
2  2019     8.9  BANGALORE
3  2020     9.8  BANGALORE
4  2019     9.6     KARWAR
5  2020     8.9     KARWAR
6  2020     9.1     MYSORE

In [15]:
df['diffrence'] = df.Year / df.Result
df

   Year  Result     Cities   diffrence
0  2019     8.6  MANGALORE  234.767442
1  2020     9.3  MANGALORE  217.204301
2  2019     8.9  BANGALORE  226.853933
3  2020     9.8  BANGALORE  206.122449
4  2019     9.6     KARWAR  210.312500
5  2020     8.9     KARWAR  226.966292
6  2020     9.1     MYSORE  221.978022

In [16]:
df['Serie_aligned'] = pd.Series(range(6), index=[0,1,2, 3, 4,6])
df

   Year  Result     Cities   diffrence  Serie_aligned
0  2019     8.6  MANGALORE  234.767442            0.0
1  2020     9.3  MANGALORE  217.204301            1.0
2  2019     8.9  BANGALORE  226.853933            2.0
3  2020     9.8  BANGALORE  206.122449            3.0
4  2019     9.6     KARWAR  210.312500            4.0
5  2020     8.9     KARWAR  226.966292            NaN
6  2020     9.1     MYSORE  221.978022            5.0

In [17]:
df.to_dict()

{'Year': {0: 2019, 1: 2020, 2: 2019, 3: 2020, 4: 2019, 5: 2020, 6: 2020},
 'Result': {0: 8.6, 1: 9.3, 2: 8.9, 3: 9.8, 4: 9.6, 5: 8.9, 6: 9.1},
 'Cities': {0: 'MANGALORE',
  1: 'MANGALORE',
  2: 'BANGALORE',
  3: 'BANGALORE',
  4: 'KARWAR',
  5: 'KARWAR',
  6: 'MYSORE'},
 'diffrence': {0: 234.7674418604651,
  1: 217.2043010752688,
  2: 226.85393258426964,
  3: 206.1224489795918,
  4: 210.3125,
  5: 226.96629213483146,
  6: 221.97802197802199},
 'Serie_aligned': {0: 0.0, 1: 1.0, 2: 2.0, 3: 3.0, 4: 4.0, 5: nan, 6: 5.0}}

In [18]:
pd.DataFrame(df.to_dict())

   Year  Result     Cities   diffrence  Serie_aligned
0  2019     8.6  MANGALORE  234.767442            0.0
1  2020     9.3  MANGALORE  217.204301            1.0
2  2019     8.9  BANGALORE  226.853933            2.0
3  2020     9.8  BANGALORE  206.122449            3.0
4  2019     9.6     KARWAR  210.312500            4.0
5  2020     8.9     KARWAR  226.966292            NaN
6  2020     9.1     MYSORE  221.978022            5.0

In [19]:
data = [{'m': i, 'n':20* i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'m': 0, 'n': 0}, {'m': 1, 'n': 20}, {'m': 2, 'n': 40}, {'m': 3, 'n': 60}, {'m': 4, 'n': 80}, {'m': 5, 'n': 100}]

   m    n
0  0    0
1  1   20
2  2   40
3  3   60
4  4   80
5  5  100

In [20]:
pd.DataFrame([{'mm': 1, 'nn': 2}, {'nn': 4, 'pp': 8}])

    mm  nn   pp
0  1.0   2  NaN
1  NaN   4  8.0

In [21]:
pd.DataFrame(np.random.randint(1, 15),
             columns=['foo', 'bar'],
             index=['m', 'n', 'p'])

   foo  bar
m    6    6
n    6    6
p    6    6

In [22]:
ind = pd.Index([10, 56, 27, 87,60, 821])
ind

Int64Index([10, 56, 27, 87, 60, 821], dtype='int64')

In [23]:
ind[5]

821

In [24]:
ind[::]

Int64Index([10, 56, 27, 87, 60, 821], dtype='int64')

In [25]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

6 (6,) 1 int64

In [26]:
rng = np.random.RandomState(18)
ser = pd.Series(rng.randint(0, 15, 9))
ser

0    10
1     3
2     8
3     5
4    14
5     1
6    14
7     2
8     2
dtype: int32

In [27]:
dfr = pd.DataFrame(rng.randint(0, 18, (6, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

    A   B   C   D
0   8   2  17   5
1  15  10  10  11
2   4   4  11   1
3   3   9   5  14
4   6  13   8   0
5   9  13  10  13

In [28]:
np.exp(ser)

0    2.202647e+04
1    2.008554e+01
2    2.980958e+03
3    1.484132e+02
4    1.202604e+06
5    2.718282e+00
6    1.202604e+06
7    7.389056e+00
8    7.389056e+00
dtype: float64

In [29]:
np.sin(dfr * np.pi / 4)

              A             B             C         D
0 -2.449294e-16  1.000000e+00  7.071068e-01 -0.707107
1 -7.071068e-01  1.000000e+00  1.000000e+00  0.707107
2  1.224647e-16  1.224647e-16  7.071068e-01  0.707107
3  7.071068e-01  7.071068e-01 -7.071068e-01 -1.000000
4 -1.000000e+00 -7.071068e-01 -2.449294e-16  0.000000
5  7.071068e-01 -7.071068e-01  1.000000e+00 -0.707107

In [30]:
area = pd.Series({'Bangalore': 1757, 'Mangalore': 6662,
                  'Cennai': 4467 , 'Delhi':5313}, name='area')
population = pd.Series({'Cannada': 38352521, 'Tokyo': 2644193,
                        'New zealand': 191121327 , 'India':456595}, name='population')
print(area)
population

Bangalore    1757
Mangalore    6662
Cennai       4467
Delhi        5313
Name: area, dtype: int64

Cannada         38352521
Tokyo            2644193
New zealand    191121327
India             456595
Name: population, dtype: int64

In [31]:
population / area

Bangalore     NaN
Cannada       NaN
Cennai        NaN
Delhi         NaN
India         NaN
Mangalore     NaN
New zealand   NaN
Tokyo         NaN
dtype: float64

In [32]:
area.index | population.index

Index(['Bangalore', 'Cannada', 'Cennai', 'Delhi', 'India', 'Mangalore',
       'New zealand', 'Tokyo'],
      dtype='object')

In [33]:
A = pd.Series([2, 4, 6 , 8 , 10], index=[0, 1, 2 , 3 ,4])
B = pd.Series([1, 3, 5 , 7 , 9], index=[1, 2, 3, 4 , 5])
print(A)
print(B)
B
A + B

0     2
1     4
2     6
3     8
4    10
dtype: int64
1    1
2    3
3    5
4    7
5    9
dtype: int64

0     NaN
1     5.0
2     9.0
3    13.0
4    17.0
5     NaN
dtype: float64

In [34]:
A.add(B, fill_value=0)

0     2.0
1     5.0
2     9.0
3    13.0
4    17.0
5     9.0
dtype: float64

In [35]:
df

   Year  Result     Cities   diffrence  Serie_aligned
0  2019     8.6  MANGALORE  234.767442            0.0
1  2020     9.3  MANGALORE  217.204301            1.0
2  2019     8.9  BANGALORE  226.853933            2.0
3  2020     9.8  BANGALORE  206.122449            3.0
4  2019     9.6     KARWAR  210.312500            4.0
5  2020     8.9     KARWAR  226.966292            NaN
6  2020     9.1     MYSORE  221.978022            5.0

In [36]:
df2 = pd.DataFrame({"cities": ["MANGALORE", "MANGALORE", "MYSORE", "KARWAR"], "Population": ["100", "200", "300","400"]})
df2

      cities Population
0  MANGALORE        100
1  MANGALORE        200
2     MYSORE        300
3     KARWAR        400

In [37]:
df3 = pd.DataFrame({"cities": ["MANGALORE", "MYSORE"], "Population": ["100","700"]})
df3
df.merge(df3, right_on='cities', left_on='Cities')

   Year  Result     Cities   diffrence  Serie_aligned     cities Population
0  2019     8.6  MANGALORE  234.767442            0.0  MANGALORE        100
1  2020     9.3  MANGALORE  217.204301            1.0  MANGALORE        100
2  2020     9.1     MYSORE  221.978022            5.0     MYSORE        700

In [38]:
df4 = pd.DataFrame({"Cities": ["MANGALORE", "BANGALORE", "KARWAR"], "Population": ["100", "200", "500"]})
df.merge(df4, how='outer')

   Year  Result     Cities   diffrence  Serie_aligned Population
0  2019     8.6  MANGALORE  234.767442            0.0        100
1  2020     9.3  MANGALORE  217.204301            1.0        100
2  2019     8.9  BANGALORE  226.853933            2.0        200
3  2020     9.8  BANGALORE  206.122449            3.0        200
4  2019     9.6     KARWAR  210.312500            4.0        500
5  2020     8.9     KARWAR  226.966292            NaN        500
6  2020     9.1     MYSORE  221.978022            5.0        NaN

In [39]:
df5 = pd.DataFrame({"Cities": ["BANGALORE", "MYSORE", "KARWAR"], "Population": ["100", "200", "500"]})
print(df)
df.merge(df5, how='outer')

   Year  Result     Cities   diffrence  Serie_aligned
0  2019     8.6  MANGALORE  234.767442            0.0
1  2020     9.3  MANGALORE  217.204301            1.0
2  2019     8.9  BANGALORE  226.853933            2.0
3  2020     9.8  BANGALORE  206.122449            3.0
4  2019     9.6     KARWAR  210.312500            4.0
5  2020     8.9     KARWAR  226.966292            NaN
6  2020     9.1     MYSORE  221.978022            5.0

   Year  Result     Cities   diffrence  Serie_aligned Population
0  2019     8.6  MANGALORE  234.767442            0.0        NaN
1  2020     9.3  MANGALORE  217.204301            1.0        NaN
2  2019     8.9  BANGALORE  226.853933            2.0        100
3  2020     9.8  BANGALORE  206.122449            3.0        100
4  2019     9.6     KARWAR  210.312500            4.0        500
5  2020     8.9     KARWAR  226.966292            NaN        500
6  2020     9.1     MYSORE  221.978022            5.0        200

In [40]:
serie_m = pd.Series([5.2 , np.nan, np.nan, 8.6, np.nan, 8.5],
                     index=['p', 'e', 'q', 'c', 'r', 'a'])
serie_n = pd.Series(np.arange(len(serie_m), dtype=np.float64),
                 index=['p', 'e', 'q', 'c', 'r', 'a'])

In [41]:
serie_m

p    5.2
e    NaN
q    NaN
c    8.6
r    NaN
a    8.5
dtype: float64

In [42]:
serie_n

p    0.0
e    1.0
q    2.0
c    3.0
r    4.0
a    5.0
dtype: float64

In [43]:
serie_m.combine_first(serie_n)

p    5.2
e    1.0
q    2.0
c    8.6
r    4.0
a    8.5
dtype: float64